{"vendorListVersion": 17, "lastUpdated": "2023-09-07T18:14:00Z", "purposes": {"1": {"id": 1, "name": "Tietojen tallentaminen laitteelle ja/tai laitteella oleviin tietoihin pääseminen", "description": "Evästeet, laitteet tai vastaavat verkkotunnisteet (esimerkiksi kirjautumisperusteiset tunnisteet, satunnaisesti määritetyt tunnisteet, verkkopohjaiset tunnisteet) sekä muut tiedot (esimerkiksi selaimen tyyppi ja tiedot, kieli, näytön koko, tuetut tekniikat jne.) voidaan tallentaa laitteellesi tai lukea laitteellasi laitteen tunnistamiseksi joka kerta, kun se muodostaa yhteyden sovellukseen tai verkkosivustoon yhdessä tai useammassa tässä esitetyssä tarkoituksessa.", "illustrations": ["Useimmat tässä ilmoituksessa kuvatut tarkoitukset perustuvat tietojen tallennukseen tai käyttöön laitteeltasi, kun käytät sovellusta tai vierailet verkkosivustolla. Myyjä tai julkaisija voi esimerkiksi joutua tallentamaan evästeen laitteellesi, kun vierailet verkkosivustolla ensimmäisen kerran, jotta laitteesi voidaan tunnistaa seuraavilla käynneilläsi (käyttämällä tätä evästettä joka kerta)."]}, "2": {"id": 2, "name": "Rajoitettujen tietojen käyttö mainonnan valitsemiseen", "description": "Tässä palvelussa sinulle esitetty mainonta voi perustua rajoitettuihin tietoihin, kuten käyttämääsi verkkosivustoon tai sovellukseen, likimääräiseen sijaintiisi, laitteesi tyyppiin tai sisältöön, jonka kanssa olet (tai olet ollut) vuorovaikutuksessa (esimerkiksi rajoittaaksemme sitä, kuinka monta kertaa mainos esitetään sinulle).", "illustrations": ["Autonvalmistaja haluaa mainostaa sähköautojaan ympäristötietoisille käyttäjille, jotka asuvat kaupungissa toimistoaikojen jälkeen. Mainonta esitetään sivulla, jolla on siihen liittyvää sisältöä (kuten ilmastonmuutosta koskeva artikkeli), kello 18.30 jälkeen käyttäjille, joiden likimääräinen sijainti viittaa siihen, että he ovat kaupunkialueella.", "Suuri vesivärimaalien tuottaja haluaa toteuttaa uusimman vesivärivalikoimansa verkkomainontakampanjan, jonka avulla tuottaja tavoittaa entistä laajemman yleisön eli mahdollisimman monta amatööri- ja ammattitaiteilijaa ja välttää mainoksen esittämisen ristiriitaisen sisällön yhteydessä (esimerkiksi talon maalaamista koskevat artikkelit). Mainoksen esityskerrat sinulle havaitaan ja niitä rajoitetaan, jotta mainosta ei esitetä liian usein."]}, "3": {"id": 3, "name": "Profiilien luominen yksilöityä mainontaa varten", "description": "Tietoja toiminnastasi tässä palvelussa (kuten lähettämäsi lomakkeet, tarkastelemasi sisältö) voidaan tallentaa ja yhdistää muihin sinua koskeviin tietoihin (esimerkiksi tiedot aiemmasta toiminnastasi tässä palvelussa ja muilla verkkosivustoilla tai muissa sovelluksissa) tai vastaaviin käyttäjiin. Tätä käytetään sitten sinua koskevan profiilin luomiseen tai parantamiseen (profiili voi sisältää mahdolliset kiinnostuksen kohteet ja henkilökohtaiset näkökohdat). Profiiliasi voidaan käyttää (myös myöhemmin) esittämään mainontaa, joka vaikuttaa merkityksellisemmältä tämän ja muihin tahoihin kohdistuvien mahdollisten kiinnostuksen kohteidesi perusteella.", "illustrations": ["Jos luet useita artikkeleita parhaista pyöräilyn lisävarusteista, näitä tietoja voidaan käyttää profiilin luomiseen kiinnostuksestasi pyöräilyn lisävarusteisiin. Tätä profiilia voidaan käyttää tai parantaa myöhemmin samalla tai toisella verkkosivustolla tai samassa tai toisessa sovelluksessa tietyn pyöräilyn lisävarustemerkin mainonnan esittämiseksi. Jos tarkastelet myös ajoneuvon valintaominaisuutta luksusautojen valmistajan verkkosivustolla, nämä tiedot voidaan yhdistää kiinnostukseesi pyöriä kohtaan profiilisi parantamiseksi ja olettamalla, että olet kiinnostunut luksuspyöräilyvarusteista.", "Asusteyritys haluaa mainostaa uutta huippuluokan lastenvaatemallistoaan. Se ottaa yhteyttä toimistoon, jolla on suurituloisten asiakkaiden verkosto (kuten huippusupermarketit) ja pyytää toimistoa luomaan profiileja nuorista vanhemmista tai pariskunnista, joiden voidaan olettaa olevan varakkaita ja hankkivan lapsen. Profiileja voidaan myöhemmin käyttää mainosten esittämiseen kumppanisovelluksissa näiden profiilien perusteella."]}, "4": {"id": 4, "name": "Profiilien käyttö yksilöidyn mainonnan valitsemiseen", "description": "Tässä palvelussa sinulle esitetty mainonta voi perustua mainosprofiileihisi, jotka voivat heijastaa toimintaasi tässä palvelussa tai muilla verkkosivustoilla tai muissa sovelluksissa (kuten lähettämäsi lomakkeet, tarkastelemasi sisältö), mahdollisia kiinnostuksen kohteitasi ja henkilökohtaisia näkökohtia.", "illustrations": ["Verkkokauppa haluaa mainostaa juoksukenkiä rajoitetussa alennusmyynnissä. Se haluaa kohdistaa mainontaa käyttäjille, jotka ovat aiemmin katsoneet juoksukenkiä mobiilisovelluksessaan. Seurantatekniikoita voidaan käyttää tunnistamaan, että olet aiemmin käyttänyt mobiilisovellusta juoksukenkiin tutustumiseen, jotta sinulle voidaan esittää vastaava mainos sovelluksessa.", "Yksilöityä mainontaa varten luotua profiilia, joka liittyy henkilöön, joka on etsinyt pyörätarvikkeita verkkosivustolta, voidaan käyttää esittämään pyörätarvikkeiden mainos toisen organisaation mobiilisovelluksessa."]}, "5": {"id": 5, "name": "Yksilöidyn sisältöprofiilin luominen", "description": "Tietoja toiminnastasi tässä palvelussa (kuten lähettämäsi lomakkeet, tarkastelemasi muu sisältö kuin mainokset) voidaan tallentaa ja yhdistää muihin sinua koskeviin tietoihin (esimerkiksi tiedot aiemmasta toiminnastasi tässä palvelussa ja muilla verkkosivustoilla tai muissa sovelluksissa) tai vastaaviin käyttäjiin. Tätä käytetään sitten sinua koskevan profiilin luomiseen tai parantamiseen (profiili voi sisältää mahdolliset kiinnostuksen kohteet ja henkilökohtaiset näkökohdat). Profiiliasi voidaan käyttää (myös myöhemmin) esittämään sisältöä, joka vaikuttaa merkityksellisemmältä mahdollisten kiinnostuksen kohteidesi perusteella, esimerkiksi mukauttamalla järjestystä, jossa sisältö näytetään sinulle, jotta sinun olisi entistäkin helpompi löytää kiinnostuksen kohteisiisi sopivaa sisältöä.", "illustrations": ["Luet sosiaalisen median alustalla useita artikkeleita puumajan rakentamisesta. Nämä tiedot voidaan lisätä profiiliin osoittamaan kiinnostuksesi ulkoilmakohteisiin liittyvään sisältöön sekä tee-se-itse-oppaisiin (sisällön mukauttamisen mahdollistamiseksi, jotta sinulle esimerkiksi esitetään lisää blogipostauksia ja artikkeleita puumajoista tulevaisuudessa).", "Olet katsonut kolme videota avaruustutkimuksesta eri TV-sovelluksissa. Aiheeseen liittymätön uutisalusta, johon sinulla ei ole ollut yhteyttä, rakentaa profiilin, joka perustuu kyseiseen katselukäyttäytymiseen ja merkitsee avaruustutkimisen aiheeksi, joka saattaa kiinnostaa muissa videoissa."]}, "6": {"id": 6, "name": "Profiilien käyttö yksilöidyn sisällön valitsemiseksi", "description": "Tässä palvelussa sinulle esitetty sisältö voi perustua sisällön yksilöintiprofiileihin, jotka voivat heijastaa toimintaasi tässä tai palvelussa muissa palveluissa (esimerkiksi lähettämäsi lomakkeet, tarkastelemasi sisältö), mahdollisiin kiinnostuksen kohteisiin ja henkilökohtaisiin näkökohtiin, kuten muokkaamalla järjestystä, jossa sisältö näytetään sinulle, jotta sinun olisi entistäkin helpompaa löytää sisältöä (ei mainontaa), joka vastaa kiinnostuksen kohteitasi.", "illustrations": ["Luet artikkeleita kasvisruoasta sosiaalisen median alustalla ja käytät sen jälkeen aiheeseen liittymättömän yrityksen ruoanlaittosovellusta. Sosiaalisen median alustalle sinusta luotua profiilia käytetään esittelemään sinulle kasvisreseptejä ruoanvalmistussovelluksen aloitusnäytöllä.", "Olet katsonut kolme videota soutamisesta eri sivustoilla. Aiheeseen liittymätön videonjakoalusta suosittelee viittä muuta soutuvideota, jotka saattavat kiinnostaa sinua TV-sovellusta käyttäessäsi. Tämä perustuu profiiliin, joka luotiin sinusta, kun vierailit näillä eri verkkosivustoilla katsoaksesi suoratoistovideoita."]}, "7": {"id": 7, "name": "Mainonnan tehokkuuden mittaaminen", "description": "Tietoja siitä, mitä mainontaa sinulle esitetään ja miten olet vuorovaikutuksessa sen kanssa, voidaan käyttää määrittämään, kuinka hyvin mainos on toiminut sinulle tai muille käyttäjille ja saavutettiinko mainonnan tavoitteet. Esimerkiksi näitkö mainoksen, napsautitko sitä, saiko se sinut ostamaan tuotteen tai käymään verkkosivustolla jne. Tämä on erittäin hyödyllistä mainoskampanjoiden merkityksen ymmärtämiseksi.", "illustrations": ["Olet klikannut verkkokaupan ”mustan perjantain” alennusta koskevaa mainosta julkaisijan verkkosivustolla ja ostanut tuotteen. Napsautuksesi linkitetään tähän ostokseen. Sinun ja muiden käyttäjien vuorovaikutus mitataan, jotta tiedetään, kuinka monta klikkausta mainoksessa johti ostoon.", "Olet yksi harvoista, jotka ovat napsauttaneet julkaisijan sovelluksessa sijaitsevassa verkkolahjakaupassa ”kansainvälistä arvostuspäivää” koskevaa mainosta ja alennusta. Julkaisija haluaa saada raportteja ymmärtääkseen, kuinka usein tietty mainos sijoitetaan sovellukseen, ja erityisesti ”kansainvälistä arvostuspäivää” kuvaava mainos, jota sinä ja muut käyttäjät ovat tarkastelleet tai napsauttaneet, jotta julkaisija ja sen kumppanit (kuten palvelutoimistot) voivat optimoida mainosten sijoittelun."]}, "8": {"id": 8, "name": "Sisällön tehokkuuden mittaaminen", "description": "Tietoja siitä, mitä sisältöä sinulle esitetään ja miten olet vuorovaikutuksessa sen kanssa, voidaan käyttää esimerkiksi sen määrittämiseen, saavuttiko sisältö (ei mainokset) kohdeyleisön ja vastasiko se kiinnostuksen kohteitasi. Kun esimerkiksi luet artikkelin, katsot videon, kuuntelet podcastia tai katsot tuotekuvausta, kuinka kauan käytit tätä palvelua ja verkkosivuja, joilla käyt jne. Tämä on erittäin hyödyllistä sinulle näytetyn sisällön (ei mainonnan) relevanssin ymmärtämisen kannalta.", "illustrations": ["Olet lukenut blogikirjoituksen patikoinnista julkaisijan mobiilisovelluksessa ja seurannut linkkiä suositeltuun ja aiheeseen liittyvään julkaisuun. Vuorovaikutuksesi kirjataan siten, että se osoittaa, että alkuperäinen patikointijulkaisu oli hyödyllinen sinulle ja että se onnistui kiinnostamaan sinua vastaavassa julkaisussa. Tämä mitataan sen selvittämiseksi, pitäisikö jatkossa tuottaa muita julkaisuja patikoinnista, ja mihin ne sijoitetaan mobiilisovelluksen aloitusnäytöllä.", "Sinulle esitettiin video muotitrendeistä, mutta sinä ja monet muut käyttäjät lopetitte katsomisen 30 sekunnin kuluttua. Näitä tietoja käytetään sitten muotitrendejä koskevien tulevien videoiden oikean pituuden arviointiin."]}, "9": {"id": 9, "name": "Yleisöjen ymmärtäminen eri lähteistä peräisin olevien tietojen tilastojen tai yhdistelmien avulla", "description": "Raportteja voidaan luoda sellaisten tietojoukkojen (kuten käyttäjäprofiilit, tilastot, markkinatutkimus, analytiikkatiedot) yhdistelmän perusteella, jotka koskevat vuorovaikutustasi ja muiden käyttäjien vuorovaikutusta mainonnan tai muun kuin mainontasisällön kanssa yhteisten ominaisuuksien tunnistamiseksi (esimerkiksi sen määrittämiseksi, mitkä kohdeyleisöt ovat vastaanottavaisempia mainoskampanjalle tai tietylle sisällölle).", "illustrations": ["Verkkokirjakaupan omistaja haluaa kaupallisen raportoinnin, josta käy ilmi sen sivustossa käyneiden ja sieltä poistuneiden ostoksia tekemättömien vierailijoiden osuus tai sellaisten vierailijoiden osuus, jotka ovat tutustuneet kuukauden julkkisomaelämäkertaan ja ostaneet sen, sekä kunkin luokan keski-ikä ja miesten/naisten jakautuminen. Sivustolla navigointiisi ja henkilökohtaisiin ominaisuuksiisi liittyviä tietoja käytetään ja yhdistetään muihin tällaisiin tietoihin näiden tilastojen tuottamiseksi.", "Mainostaja haluaa ymmärtää paremmin, minkä tyyppinen yleisö on vuorovaikutuksessa mainostajan mainosten kanssa. Se pyytää tutkimuslaitosta vertaamaan mainoksen kanssa vuorovaikutuksessa olleiden käyttäjien ominaisuuksia samankaltaisten alustojen käyttäjien tyypillisiin ominaisuuksiin eri laitteilla. Vertailu paljastaa mainostajalle, että sen mainosyleisö käyttää mainoksia pääasiassa mobiililaitteilla ja että se on todennäköisesti 45–60-vuotiaita."]}, "10": {"id": 10, "name": "Palvelujen kehittäminen ja parantaminen", "description": "Tiedot toiminnastasi tässä palvelussa, kuten vuorovaikutuksestasi mainosten tai sisällön kanssa, voivat olla erittäin hyödyllisiä tuotteiden ja palveluiden parantamiseksi ja uusien tuotteiden ja palveluiden rakentamiseksi käyttäjien vuorovaikutuksen, yleisön tyypin jne. perusteella. Tämä erityinen tarkoitus ei sisällä käyttäjäprofiilien ja tunnisteiden kehittämistä tai parantamista.", "illustrations": ["Teknologia-alusta, joka työskentelee sosiaalisen median tarjoajan kanssa, havaitsee mobiilisovellusten käyttäjien määrän kasvun ja näkee heidän profiiliensa perusteella, että monet heistä ovat yhteydessä mobiiliyhteyksien kautta. Se käyttää uutta teknologiaa mobiililaitteille alustettujen ja alhaisen kaistanleveyden mainosten toimittamiseen niiden suorituskyvyn parantamiseksi.", "Mainostaja etsii tapaa näyttää mainoksia uudentyyppisellä kuluttajalaitteella. Se kerää tietoja siitä, miten käyttäjät ovat vuorovaikutuksessa tämän uudentyyppisen laitteen kanssa, määrittääkseen, voiko se rakentaa uuden mekanismin mainonnan näyttämiseksi tämäntyyppisellä laitteella."]}, "11": {"id": 11, "name": "Rajoitettujen tietojen käyttö sisällön valitsemiseen", "description": "Tässä palvelussa sinulle esitetty mainonta voi perustua rajoitettuihin tietoihin, kuten käyttämääsi verkkosivustoon tai sovellukseen, likimääräiseen sijaintiisi, laitteesi tyyppiin tai sisältöön, jonka kanssa olet (tai olet ollut) vuorovaikutuksessa (esimerkiksi rajoittaaksemme sitä, kuinka monta kertaa video tai artikkeli esitetään sinulle).", "illustrations": ["Matkailulehti on julkaissut verkkosivuillaan artikkelin kielikoulun ehdottamista uusista verkkokursseista matkustuskokemusten parantamiseksi ulkomailla. Koulun blogikirjoitukset lisätään suoraan sivun alareunaan, ja ne valitaan likimääräisen sijaintisi perusteella (esimerkiksi blogikirjoitukset, joissa selitetään muun kuin sijaintimaasi kielen kielten kurssisisältöjä).", "Urheilu-uutisten mobiilisovellus on aloittanut uuden artikkeliosion, joka käsittelee viimeisimpiä jalkapallo-otteluita. Kukin artikkeli sisältää videoita, joita isännöi erillinen, kunkin ottelun kohokohdat esittävä suoratoistoalusta. Jos siirrät videon nopeasti eteenpäin, tätä tietoa voidaan käyttää valitsemaan lyhyempi video, joka toistetaan seuraavaksi."]}, "25": {"id": 25, "name": "Pakolliset evästeet", "description": "Nämä evästeet ovat pakollisia nettisivun toiminnan kannalta, eivätkä ne tallenna henkilötietoja. Nämä evästeet käsittelevät palvelun toiminnallisuuden kannalta olennaisia tietoja, kuten käyttäjän asetuksia, sisäänkirjautumistietoja ja tietosuoja-asetuksia. Näitä evästeitä ei yleensä voi poistaa, mutta jotkut selaimet voivat kuitenkin estää ne tai varoittaa sinua näistä evästeistä. Huomaa, että näiden evästeiden poisto vaikuttaa sivuston toimintaan.", "illustrations": []}, "26": {"id": 26, "name": "Toiminnallisuus", "description": "Nämä evästeet sallivat paremman käyttäjäkokemuksen parannettujen ominaisuuksien, kuten personoinnin, kautta. Jos näitä evästeitä ei sallita, ne saattavat vaikuttaa haitallisesti joihinkin tai kaikkiin näistä ominaisuuksista.", "illustrations": []}, "27": {"id": 27, "name": "Analysointi", "description": "Nämä evästeet keräävät anonyymiä, yhdistettyä tilastotietoa, jonka avulla pystymme tunnistamaan suosituimmat sivumme ja sisältömme voidaksemme parantaa sivustoamme ja kävijöille tarjoamaamme kokemusta. Näiden evästeiden estäminen vaikuttaa negatiivisesti mahdollisuuteemme parantaa tuotteitamme ja palveluitamme.", "illustrations": []}, "28": {"id": 28, "name": "Mainonta", "description": "Näitä evästeitä mainoskumppanimme voivat asettaa sivustollemme. Nämä yritykset voivat käyttää evästetietoja rakentaakseen profiilin kiinnostuksen kohteistasi ja näyttääkseen sinulle kohdennettuja mainoksia muilla sivustoilla. Ne eivät tallenna suoranaisia henkilötietoja, mutta perustuvat selaimesi ja internet-laitteidesi yksilöintiin. Jos et salli näitä evästeitä, mainonta ei ole yhtä kohdennettua.", "illustrations": []}, "29": {"id": 29, "name": "Sosiaalinen media", "description": "Nämä evästeet sallivat sisältömme jakamisen kävijän ystäville ja sosiaalisiin verkostoihin. Ne voivat seurata toimintaa eri nettisivuilla rakentaakseen käyttäjäprofiilin, jonka avulla tarjotaan osuvampaa sisältöä muilla vierailluilla sivustoilla.", "illustrations": []}, "30": {"id": 30, "name": "Suoramarkkinointi", "description": "Suoramarkkinointievästeiden avulla yhdistämme sähköpostiosoitteet ja muun tarjolla olevan tiedon, jotta mainostajat voivat tavoittaa käyttäjiä sähköpostitse uutiskirjeen avulla. Näiden avulla hallitsemme paremmin mainostajille tarjolla olevia tietoja ja voimme asettaa selkeät odotukset näille sähköposteille. Sallimalla evästeet autat meitä torjumaan roskapostia.", "illustrations": []}, "31": {"id": 31, "name": "Datan jakaminen", "description": "Segmentti- ja mallinnustietojen jakaminen valituille toimittajille. Toimittaja voi yhdistää tietosegmentti- ja mallinnustiedot omiin tietoihinsa tavoittaakseen tuotteestaan tai palvelustaan mahdollisesti kiinnostuneet kohderyhmät. Henkilöä ei voida tunnistaa suoraan näistä tiedoista. Tietoja säilytetään vain lyhyen aikaa kampanjan toteuttamiseksi.", "illustrations": []}}, "specialPurposes": {"1": {"id": 1, "name": "Turvallisuuden varmistaminen, petosten ehkäiseminen ja havaitseminen sekä virheiden korjaaminen", "description": "Tietojasi voidaan käyttää epätavallisen ja mahdollisesti petollisen toiminnan valvontaan ja ehkäisyyn (esimerkiksi mainonta, bottien mainosklikkaukset) sekä järjestelmien ja prosessien asianmukaisen ja turvallisen toiminnan varmistamiseen. Niitä voidaan käyttää myös sellaisten mahdollisten ongelmien korjaamiseen, joita sinä, julkaisija tai mainostaja saatatte kohdata sisällön ja mainosten toimituksessa ja vuorovaikutuksessasi niiden kanssa.", "illustrations": ["Mainosvälittäjä toimittaa mainoksia eri mainostajilta kumppanisivustoilleen. Se huomaa, että yhteen mainostajaan liittyvien mainosten klikkausten määrä lisääntyy huomattavasti, ja käyttää klikkausten lähdettä koskevia tietoja määrittääkseen, että 80 % klikkauksista tulee boteilta ihmisten sijaan."]}, "2": {"id": 2, "name": "Mainonnan ja sisällön toimittaminen ja esittäminen", "description": "Tiettyjä tietoja (kuten IP-osoitetta tai laiteominaisuuksia) käytetään sisällön tai mainonnan teknisen yhteensopivuuden varmistamiseen ja sisällön tai mainonnan välittämisen helpottamiseen laitteellesi.", "illustrations": ["Artikkelin linkin napsauttaminen voi yleensä siirtää sinut toiselle sivulle tai toiseen artikkelin osaan. Tämän saavuttamiseksi 1°) selaimesi lähettää pyynnön verkkosivustoon linkitetylle palvelimelle, 2°) palvelin vastaa takaisin (”tässä on pyytämäsi artikkeli”) käyttäen laitteesi lähettämään pyyntöön automaattisesti sisältyviä teknisiä tietoja, jotta pyytämääsi artikkeliin kuuluvat tiedot/kuvat voidaan näyttää asianmukaisesti. Teknisesti tällainen tietojen vaihto on tarpeen näytölläsi näkyvän sisällön toimittamiseksi."]}, "25": {"id": 25, "name": "", "description": "", "illustrations": []}, "26": {"id": 26, "name": "", "description": "", "illustrations": []}}, "features": {"1": {"id": 1, "name": "Muista tietolähteistä peräisin olevien tietojen vertaaminen ja yhdistäminen", "description": "Tietoja toiminnastasi tässä palvelussa voidaan verrata ja yhdistää muihin sinua koskeviin tietoihin, jotka ovat peräisin eri lähteistä (esimerkiksi toiminnastasi erillisessä verkkopalvelussa, kanta-asiakaskortin käytöstäsi myymälässä tai vastauksistasi kyselyyn) tässä ilmoituksessa kuvattujen tarkoitusten tueksi.", "illustrations": []}, "2": {"id": 2, "name": "Eri laitteiden yhdistäminen toisiinsa", "description": "Tässä ilmoituksessa kuvattujen tarkoitusten tueksi laitettasi voidaan pitää todennäköisesti linkitettynä muihin laitteisiin, jotka kuuluvat sinulle tai kotitaloudellesi (esimerkiksi siksi, että olet kirjautunut samaan palveluun sekä puhelimellasi että tietokoneellasi tai koska voit käyttää samaa internet-yhteyttä molemmilla laitteilla).", "illustrations": []}, "3": {"id": 3, "name": "Laitteiden tunnistaminen automaattisesti lähetettyjen tietojen perusteella", "description": "Laitteesi saatetaan erottaa muista laitteista internetin käytön yhteydessä sen automaattisesti lähettämien tietojen perusteella (esimerkiksi internet-yhteytesi IP-osoite tai käyttämäsi selaintyyppi) tässä ilmoituksessa esitettyjen tarkoitusten tueksi.", "illustrations": []}}, "specialFeatures": {"1": {"id": 1, "name": "Tarkkojen sijaintitietojen käyttäminen", "description": "Hyväksynnälläsi tarkkaa sijaintiasi (alle 500 metrin säteellä) voidaan käyttää tässä ilmoituksessa kuvattujen tarkoitusten tueksi.", "illustrations": []}, "2": {"id": 2, "name": "Laitteen ominaisuuksien aktiivinen skannaaminen tunnistamista varten", "description": "Hyväksynnälläsi tiettyjä laitettasi koskevia ominaisuuksia saatetaan pyytää ja käyttää erottamaan se muista laitteista (kuten asennetut fontit tai laajennukset, näyttösi resoluutio) tässä ilmoituksessa kuvattujen tarkoitusten tueksi.", "illustrations": []}}, "stacks": {"2": {"id": 2, "purposes": [2, 7], "specialFeatures": [], "name": "Rajoitettuun dataan ja mainontamittaukseen perustuva mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Mainonnan suorituskykyä voidaan mitata."}, "3": {"id": 3, "purposes": [2, 3, 4], "specialFeatures": [], "name": "Yksilöity mainonta", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten."}, "4": {"id": 4, "purposes": [2, 7, 9], "specialFeatures": [], "name": "Rajoitettuun dataan, mainontamittaukseen ja yleisötutkimukseen perustuva mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Mainonnan suorituskykyä voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "5": {"id": 5, "purposes": [2, 3, 7], "specialFeatures": [], "name": "Rajoitettuun dataan, yksilöityyn mainontaprofiiliin ja mainontamittaukseen perustuva mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainonnan suorituskykyä voidaan mitata."}, "6": {"id": 6, "purposes": [2, 4, 7], "specialFeatures": [], "name": "Yksilöidyn mainonnan valinta ja mainonnan mittaus", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Mainonnan suorituskykyä voidaan mitata."}, "7": {"id": 7, "purposes": [2, 4, 7, 9], "specialFeatures": [], "name": "Yksilöidyn mainonnan valinta, mainonnan mittaus ja yleisötutkimus", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Mainonnan suorituskykyä voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "8": {"id": 8, "purposes": [2, 3, 4, 7], "specialFeatures": [], "name": "Yksilöity mainonta ja mainonnan mittaus", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainonnan suorituskykyä voidaan mitata."}, "9": {"id": 9, "purposes": [2, 3, 4, 7, 9], "specialFeatures": [], "name": "Yksilöity mainonta, mainonnan mittaus ja yleisötutkimus", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainonnan suorituskykyä voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "10": {"id": 10, "purposes": [3, 4], "specialFeatures": [], "name": "Yksilöity mainonta", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten."}, "11": {"id": 11, "purposes": [5, 6], "specialFeatures": [], "name": "Yksilöity sisältö", "description": "Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten."}, "12": {"id": 12, "purposes": [6, 8, 11], "specialFeatures": [], "name": "Yksilöidyn sisällön valinta ja sisältöä koskevat mittaukset", "description": "Sisältö voidaan yksilöidä profiilisi perusteella. Sisällön tehokkuutta voidaan mitata."}, "13": {"id": 13, "purposes": [6, 8, 11], "specialFeatures": [], "name": "Yksilöidyn sisällön valinta, sisältöä koskevat mittaukset ja yleisötutkimus", "description": "Sisältö voidaan yksilöidä profiilisi perusteella. Sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "14": {"id": 14, "purposes": [5, 6, 8, 11], "specialFeatures": [], "name": "Yksilöity sisältö ja sisältöä koskevat mittaukset", "description": "Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Sisällön tehokkuutta voidaan mitata."}, "15": {"id": 15, "purposes": [5, 6, 8, 9, 11], "specialFeatures": [], "name": "Yksilöity sisältö, sisältöä koskevat mittaukset ja yleisötutkimus", "description": "Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "16": {"id": 16, "purposes": [5, 6, 8, 9, 10, 11], "specialFeatures": [], "name": "Yksilöity sisältö, sisältöä koskevat mittaukset, yleisötutkimus ja palvelujen kehittäminen", "description": "Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "17": {"id": 17, "purposes": [7, 8, 9], "specialFeatures": [], "name": "Mainontaa ja sisältöä koskevat mittaukset sekä yleisötutkimus", "description": "Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "18": {"id": 18, "purposes": [7, 8], "specialFeatures": [], "name": "Mainontaa ja sisältöä koskevat mittaukset", "description": "Mainosten ja sisällön tehokkuutta voidaan mitata."}, "19": {"id": 19, "purposes": [7, 9], "specialFeatures": [], "name": "Mainontaa koskevat mittaukset ja yleisötutkimus", "description": "Mainontaa voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "20": {"id": 20, "purposes": [7, 8, 9, 10], "specialFeatures": [], "name": "Mainontaa ja sisältöä koskevat mittaukset, yleisötutkimus ja palvelujen kehittäminen", "description": "Mainosten ja sisällön tehokkuutta voidaan mitata. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "21": {"id": 21, "purposes": [8, 9, 10], "specialFeatures": [], "name": "Sisältöä koskevat mittaukset, yleisötutkimus ja palveluiden kehittäminen", "description": "Sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "22": {"id": 22, "purposes": [8, 10], "specialFeatures": [], "name": "Sisältöä koskevat mittaukset ja palveluiden kehittäminen", "description": "Sisällön tehokkuutta voidaan mitata. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "23": {"id": 23, "purposes": [2, 4, 6, 7, 8, 11], "specialFeatures": [], "name": "Yksilöidyn mainonnan ja sisällön valinta, mainonnan ja sisällön mittaaminen", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Mainosten ja sisällön tehokkuutta voidaan mitata."}, "24": {"id": 24, "purposes": [2, 4, 6, 7, 8, 9, 11], "specialFeatures": [], "name": "Yksilöidyn mainonnan ja sisällön valinta, mainonnan ja sisällön mittaaminen sekä yleisötutkimus", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Tietoja voidaan käyttää käyttäjäkokemuksen, järjestelmien ja ohjelmistojen luomiseen tai parantamiseen."}, "25": {"id": 25, "purposes": [2, 3, 4, 5, 6, 7, 8, 11], "specialFeatures": [], "name": "Yksilöity mainonta ja sisältö, mainonnan ja sisällön mittaaminen", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa tai sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata."}, "26": {"id": 26, "purposes": [2, 3, 4, 5, 6, 7, 8, 9, 11], "specialFeatures": [], "name": "Yksilöity mainonta ja sisältö, mainonnan ja sisällön mittaaminen sekä yleisötutkimus", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa tai sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "27": {"id": 27, "purposes": [3, 5], "specialFeatures": [], "name": "Yksilöity mainonta- ja sisältöprofiili", "description": "Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa tai sisältöä varten."}, "28": {"id": 28, "purposes": [2, 4, 6, 11], "specialFeatures": [], "name": "Yksilöidyn mainonta- ja sisältöprofiilin valinta", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella."}, "29": {"id": 29, "purposes": [2, 7, 8, 9], "specialFeatures": [], "name": "Rajoitettuun dataan, mainonnan ja sisällön mittaukseen sekä yleisötutkimukseen perustuva mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "30": {"id": 30, "purposes": [2, 4, 5, 6, 7, 8, 9, 11], "specialFeatures": [], "name": "Yksilöidyn mainonnan valinta, yksilöity sisältö, mainonnan ja sisällön mittaaminen sekä yleisötutkimus", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa tai sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "31": {"id": 31, "purposes": [2, 4, 5, 6, 7, 8, 9, 10, 11], "specialFeatures": [], "name": "Yksilöidyn mainonnan valinta, yksilöity sisältö, mainonnan ja sisällön mittaaminen, yleisötutkimus ja palvelujen kehittäminen", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "32": {"id": 32, "purposes": [2, 5, 6, 7, 8, 9, 11], "specialFeatures": [], "name": "Rajoitetun datan, yksilöidyn sisällön, mainonnan ja sisällön mittauksen sekä yleisötutkimuksen perusteella tehty mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "33": {"id": 33, "purposes": [2, 5, 6, 7, 8, 9, 10, 11], "specialFeatures": [], "name": "Rajoitetun datan, yksilöidyn sisällön, mainonnan ja sisällön mittauksen, yleisötutkimuksen ja palvelujen kehittämisen perusteella tehty mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "34": {"id": 34, "purposes": [2, 5, 6, 8, 9, 11], "specialFeatures": [], "name": "Rajoitetun datan, yksilöidyn sisällön, sisällön mittauksen sekä yleisötutkimuksen perusteella tehty mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella."}, "35": {"id": 35, "purposes": [2, 5, 6, 8, 9, 10, 11], "specialFeatures": [], "name": "Rajoitetun datan, yksilöidyn sisällön, sisällön mittauksen, yleisötutkimuksen ja palvelujen kehittämisen perusteella tehty mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "36": {"id": 36, "purposes": [2, 5, 6, 7, 11], "specialFeatures": [], "name": "Rajoitetun datan, yksilöidyn sisällön ja mainonnan mittauksen perusteella tehty mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Mainonnan suorituskykyä voidaan mitata."}, "37": {"id": 37, "purposes": [2, 5, 6, 7, 10, 11], "specialFeatures": [], "name": "Rajoitetun datan, yksilöidyn sisällön, mainonnan mittauksen ja palvelujen kehittämisen perusteella tehty mainonta", "description": "Mainontaa voidaan esittää rajallisten tietojen perusteella. Sisältö voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä sisältöä varten. Mainonnan suorituskykyä voidaan mitata. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "38": {"id": 38, "purposes": [2, 3, 4, 7, 10], "specialFeatures": [], "name": "Yksilöity mainonta, mainonnan mittaus ja palvelujen kehittäminen", "description": "Mainonta voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainonnan suorituskykyä voidaan mitata. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "39": {"id": 39, "purposes": [2, 3, 4, 7, 9, 10], "specialFeatures": [], "name": "Yksilöity mainonta, mainonnan mittaus, yleisötutkimus ja palvelujen kehittäminen", "description": "Mainonta voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainonnan suorituskykyä voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "40": {"id": 40, "purposes": [2, 3, 4, 7, 8, 9, 10], "specialFeatures": [], "name": "Yksilöity mainonta, mainonnan ja sisällön mittaus, yleisötutkimus ja palvelujen kehittäminen", "description": "Mainonta voidaan yksilöidä profiilisi perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "41": {"id": 41, "purposes": [2, 3, 4, 6, 7, 8, 9, 10, 11], "specialFeatures": [], "name": "Yksilöity mainonta, yksilöidyn sisällön valinta, mainonnan ja sisällön mittaaminen, yleisötutkimus ja palvelujen kehittäminen", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "42": {"id": 42, "purposes": [2, 3, 4, 5, 6, 7, 8, 9, 10, 11], "specialFeatures": [], "name": "Yksilöity mainonta ja sisältö, mainonnan ja sisällön mittaus, yleisötutkimus ja palvelujen kehittäminen", "description": "Mainonta ja sisältö voidaan yksilöidä profiilin perusteella. Toimintaasi tässä palvelussa voidaan käyttää sinua koskevan profiilin luomiseen tai parantamiseen yksilöityä mainontaa ja sisältöä varten. Mainosten ja sisällön tehokkuutta voidaan mitata. Raportit voidaan luoda oman ja muiden toiminnan perusteella. Toimintasi tässä palvelussa voi auttaa kehittämään ja parantamaan tuotteita ja palveluita."}, "43": {"id": 43, "purposes": [8, 11], "specialFeatures": [], "name": "Rajoitettuun dataan ja sisällön mittaukseen perustuva sisältö", "description": "Sisältö voidaan valita rajallisten tietojen perusteella. Sisällön tehokkuutta voidaan mitata."}, "1": {"id": 1, "purposes": [], "specialFeatures": [1, 2], "name": "Tarkat sijaintitiedot ja tunnistaminen laitetta skannaamalla", "description": "Tarkkoja sijaintitietoja ja laiteominaisuuksia koskevia tietoja voidaan käyttää."}}, "dataCategories": {"1": {"id": 1, "name": "IP-osoitteet", "description": "IP-osoitteesi on numero, jonka internet-palveluntarjoajasi on antanut internet-yhteydelle. Se ei liity aina juuri sinun laitteeseesi eikä se ole aina sama tunniste. Sitä käytetään tietojen reitittämiseen internetissä ja verkkosisällön (mukaan lukien mainokset) näyttämiseen siihen yhdistetyllä laitteellasi."}, "2": {"id": 2, "name": "Laitteen ominaisuudet", "description": "Käyttämäsi laitteen tekniset ominaisuudet, jotka eivät ole yksilöllisiä, kuten kieli, aikavyöhyke tai käyttöjärjestelmä."}, "3": {"id": 3, "name": "Laitteen tunnisteet", "description": "Laitetunniste on yksilöllinen merkkijono, joka on määritetty laitteellesi tai selaimellesi evästeen tai muun tallennustekniikan avulla.  Se voidaan luoda tai sitä voidaan käyttää laitteesi tunnistamiseen esim. eri verkkosivuilla samalta sivustolta tai useilla sivustoilla tai sovelluksissa."}, "4": {"id": 4, "name": "Todennäköiset tunnisteet", "description": "Todennäköinen tunniste voidaan luoda yhdistämällä laitteeseesi liittyviä ominaisuuksia (käytetyn selaimen tai käyttöjärjestelmän tyyppi) ja internet-yhteyden IP-osoite. Jos annat suostumuksesi, lisäominaisuuksia (esim. asennettu fontti tai näytön resoluutio) voidaan myös yhdistää todennäköisen tunnisteen tarkkuuden parantamiseksi. Tällainen tunniste katsotaan \"todennäköiseksi\", koska useilla laitteilla voi olla samat ominaisuudet ja internet-yhteys. Sitä voidaan käyttää laitteesi tunnistamiseen esim. eri verkkosivuilla samalta sivustolta tai useilla sivustoilla tai sovelluksissa."}, "5": {"id": 5, "name": "Todennukseen perustuvat tunnisteet", "description": "Kun tunniste luodaan todennustietojen perusteella, kuten verkkosivustoilla tai sovelluksissa luomiesi verkkotilien yhteystietoihin (esim. sähköpostiosoite, puhelinnumero) tai asiakastunnisteisiin (esim. teleoperaattorisi antama tunniste) liittyen, kyseistä tunnistetta voidaan käyttää tunnistamaan sinut eri verkkosivustoilla, sovelluksissa ja laitteissa, kun olet kirjautunut sisään samoilla yhteystiedoilla."}, "6": {"id": 6, "name": "Tietojen selaus ja vuorovaikutus", "description": "Verkkotoimintasi, kuten vierailemasi verkkosivustot, käyttämäsi sovellukset, tässä palvelussa etsimäsi sisältö tai vuorovaikutuksesi sisällön tai mainosten kanssa, kuten kuinka monta kertaa olet nähnyt tiettyä sisältöä tai mainosta tai oletko klikannut sitä."}, "7": {"id": 7, "name": "Käyttäjän antamat tiedot", "description": "Tiedot, jotka olet saattanut antaa lomakkeen kautta (esim. palaute, kommentti) tai luodessasi tilin (esim. ikäsi, ammattisi)."}, "8": {"id": 8, "name": "Likimääräiset sijaintitiedot", "description": "Likimääräinen sijaintisi ilmaistaan alueena, jonka säde on vähintään 500 metriä. Likimääräinen sijaintisi voidaan päätellä esim. yhteytesi IP-osoitteesta."}, "9": {"id": 9, "name": "Tarkat sijaintitiedot", "description": "Tarkka sijaintisi alle 500 metrin säteellä GPS-koordinaattien perusteella. Sitä saa käyttää vain sinun suostumuksellasi."}, "10": {"id": 10, "name": "Käyttäjien profiilit", "description": "Tietyt ominaisuudet (esim. mahdolliset kiinnostuksen kohteesi, ostoaikomuksesi, kuluttajaprofiilisi) voidaan päätellä tai mallintaa aiemmasta verkkotoiminnastasi (esim. katsomasi sisältö tai käyttämäsi palvelu, eri verkkosisällöissä ja -palveluissa viettämäsi aika) tai antamasi tiedot (esim. ikäsi, ammattisi)."}, "11": {"id": 11, "name": "Tietosuojan valinnat", "description": "Tietojesi käsittelyä koskevat asetuksesi saamiesi tietojen perusteella."}}}